Revit 2024 API
FootPrintRoof.CurtainGrids Property
Retrieve all the CurtainGrid objects of a FootPrintRoof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CurtainGridSet CurtainGrids { get; }
Visual Basic
Public ReadOnly Property CurtainGrids As CurtainGridSet
	Get
Visual C++
public:
property CurtainGridSet^ CurtainGrids {
	CurtainGridSet^ get ();
}
Remarks
Only applicable when the object is a Curtain FootPrintRoof.
See Also
FootPrintRoof Class
Autodesk.Revit.DB Namespace